content/essays/36-25-Khashamir-2012.org
#+TITLE: Khashamir 2012
#+DATE: 2012-01-01
#+HUGO_BASE_DIR: ../../
#+HUGO_SECTION: stories
#+HUGO_TAGS: Civilians
#+EXPORT_FILE_NAME: 36-25-Khashamir-2012.org
#+LOCATION: Yemen
#+YEAR: 2012


On the day of his wedding, Salem bin Ali Jaber, a cleric and vocal opponent of al-Qaeda, was killed in a U.S. drone strike.

He had been summoned to meet suspected militants for a theological debate. As he approached the mosque, a missile struck, killing him and three others.

His cousin, who witnessed the attack, later filed legal complaints in Germany and the U.S., arguing Salem was deliberately targeted despite his anti-extremist views.

**Source:** [[https://theintercept.com/drone-papers/][The Intercept]]
